[
  {
    "type": "random",
    "query": "",
    "result": "When Chuck Norris speaks, everyone can understand him in their own tongue.",
    "timestamp": "2024-07-15T12:29:19.923Z"
  },
  {
    "type": "search",
    "query": "mother",
    "result": "Peter Piper picked a peck of pickled peppers. Chuck Norris shot him and screwed his mother against a wall for three hours.\nChuck Norris doesn't believe in ravioli. He stuffs a live turtle with beef and smothers it in pig's blood.\nmothernature asks Chuck Norris if its ok to make it rain\nChuck Norris can smother a whale with a cue tip.\nWhen Chuck Norris was a baby, he didn't suck his mother's breast. His mother served him whiskey, straight out of the bottle.\nUntil today, nobody knew that Chuck Norris' grandmother was the first Navy Seal.\nIf you ever meet Chuck Norris, it can only be better if Norris reveals he is your father, in which case your mother would have wholeheartedly believed him, and your ex-father would have been honored.\nOld Mother Hubbard Went to the cupboard, To get her poor doggy a bone. But when she bent over, Chuck Norris took over, 'cause Chuck had a bone of his own.\nStep on a crack, Chuck Norris will pulverize your spine. Then plow your mother.\nChuck Norris wasn't born, he just got tired of wearing his mother.\nIf you ever make the mistake of confessing to Chuck Norris that you are a vegetarian, prepare to be immediately smothered to death by a slab of fresh veal.\nChuck Norris talked to himself in his mother's womb.\nChuck Norris was born 9 months before his mother got pregnant.\nChuck Norris receives mothers day cards for giving birth to twins: WAR AND PEACE!!!!\nChuck Norris recently got Sylvester Stallone in a headlock and told him 'motherfucker if I ever hear you fucking swear I will motherfucking kill your entire motherfucking family, bitch'.\nCHuck Norris' Mother has a tatoo of Chuck Norris on her right bicep.\nIf a tree falls in the woods, not only did Chuck Norris hear it, he probably kicked that motherfucker over too.\nWhen Chuck Norris has an erection lasting more than 4 hours he doesn't call your doctor, he calls your mother.\nWhen the mother of Chuck Norris was pregnant she could feel him moving in her stomache. Little did she know, he was perfecting his Round House Kick.\nA man sitting next to Chuck Norris on a plane started to complain about the lack of room and got on Chuck's nerves. So he stuffed the motherfucker into the overhead storage compartment.\nChuck Norris is one badass motherchucker.\nWhen there is a thunderstorm and you see lightning, Chuck Norris follows it with by clapping his hands, causing thunder. There is no Mother Nature, only Chuck Nature.\nWhen Chuck Norris was born his mother didn't have a enough breast milk so a herd of milking cows were brought in each day. 8 weeks later he was able to dine on Texas BBQ with all the fixins.\nWhenever you say to yourself, 'at least it can't get any worse than this', that's usually the exact moment when Chuck Norris penetrates your mother.\nChuck Norris. For when you absolutely, positively have to kill every motherfucker within a ten-mile radius, including you, accept no substitute.\nChuck Norris can bang your sister while your mother watches and you clap.\nHurricanes are mother nature's way of running from Chuck Norris.\nChuck Norris' mother once caught him masticating a horse in his bedroom.\nWhy is Chuck Norris artificial fertilized?....Because nobody fucks his mother.\nWhen Chuck Norris was a baby, both of his mother's tits had a milk moustache and beard.\nChuck Norris puts the \"fun\" in funeral, the \"laughter\" in slaughter, the \"harm\" in charm, the \"ass\" in passion, the \"gas\" in orgasm, the \"man\" in woman, the \"fucker\" in motherfucker, the \"ow\" in power, the \"pain\" in Spain, the \"eat\" in death, the \"aids\" in maids, \"the \"hiv\" in shiv, the \"he\" in the, and the \"giant cock\" in your mom's ass.\nChuck Norris' mother wears bowling ball earrings.\nAs a youngster, when kissing his grandmother good night, Chuck Norris would always slip her the tongue.\nChuck Norris was never born. he roundhouse kicked his way out of his mothers whom and proceded on kicking the rest of the doctors to.\nMost men's sperm look like tadpoles. Chuck Norris's sperm look like motherfucking mudskippers.\nDaenerys Targaryen is the \"Khaleesi of the Great Grass Sea,\" the \"Breaker of Chains,\" and \"Mother of Dragons.\" She would trade all that and more to become \"Woman of Chuck Norris.\"\nChuck Norris was born while his mother was lion hunting on the African Savanna. Just seconds later he strangled a hyena with his own umbilical cord.\nThere is no adultery mother, there's just Chuck Norris in town.\nIf you see Chuck Norris screwing your mother, DO NOT APPROACH HIM. Just ignore all of the epic music playing, the explosions and the birds trying to fly in the window, and prepare a grave for her.\nWhen Chuck Norris was born, the nurses has to shave his chest, legs, armpits, genitalia, beard, fist & toe knuckle hair just to temporarily make him look like a normal baby for his mother.\nI love Chuck Norris. He was a crazy mother&#65279; picking a fight with Oak Tree.\nChuck Norris recently had to bail his mother out of jail. She was locked up for her role in a Friday night bar fight.\nChuck Norris' mother was supposed to have triplets. Only one of them was chuck, the other two didnt stand a chance.\nTHE MOTHER OF HIS MOTHER IS THE WIFE OF CHUCK NORRIS.\nWhen Chuck Norris says \"pull my finger\", plan on being cloaked in and smothered to death in brown vapor.\nSome of the alternate titles - The Expendables 2: Chuck Norris Forever, The Expendables 2: Norris And Friends, The Chuckpendables, Big Chuck And Some Ugly Overpaid Motherfuckers, and Walker: Texas Ranger: The Motion Picture.\nPeople started making the Yo-Mama jokes because they mistook Chuck Norris' bicep for your mother's fat ass.\nChuck Norris fact: John Merrick was Chuck Norris' identical twin. Chuck kicked his brothers butt inside his mothers womb for sucking on his thumb. John Merrick is known today as the elephant man.\nChuck Norris must've thought your mother blew like a ceiling fan, because he screwed her into the ceiling!\nMother Nature and Father Time came together and made Chuck Norris, But his name wasn`t always Chuck norris because it`s latin for I WILL KICK YOUR ASS.\nWhen Chuck Norris was born it wasn't his mother that pushed him out, he crawled out on his own, round house kicked the doctor and lit a cigar.\nOld Mother Hubbard went to her cupboard to get her poor doggy a bone. But when she bent over, Chuck Norris took over, 'cause Chuck had a bone of his own.\nChuck Norris once spent the night at his grandmother's house and for a goodnight kiss, he slipped her the tounge.\nDo not stare at Chuck Norris' beard, or it may feel threatened and leap off his face and smother you to death.\nChuck Norris once rappelled 12,000 ft. down a mountain cliff to save a baby eagle chick that had fallen from its nest. After he returned the chick to its nest, the mother eagle flew in carrying a dead rabbit. Chuck Norris killed her instantly with a karate chop for being neglectful and threw her feathered carcass off the cliff. Then he ripped the rabbit apart with his teeth and lovingly fed the eagle chick mouth to beak. Chuck Norris is epic.\nChuck Norris was not born. He kicked his mother off of him.\nChuck Norris' father is Chuck Norris, his mother is America, his brother is freedom and his other brother is Sam... Sam Norris. Chuck Norris loves his family dearly, except for Sam, that is why Sam no longer exists.\nWhen Chuck Norris was only 3 months old, his mother swam nude through the Okefenokee Swamp just so he could learn how to suckle blood from leaches.\nThe instant Chuck Norris came out of his mother, his first words were, \"Which one of you motherfuckers is Julius Caesar?\" The senators took the rap for him.\nChuck Norris can make his world class Texas chili in your gramdmother's old Crotch Slot\nBack in 1940, when Chuck Norris was a baby, he didn't suck his mother's breast. His mother served him whiskey. That is how he grew muscles on his 1st birthday.\nChuck Norris' mom always looks forward to every Mothers Day. Her loving son always provides her favorite gift...an uppercut.\nMother Nature doesn't mess with Chuck Norris.\nChuck Norris loves your mother.\nChuck Norris loved the soft moaning sounds your mother made when they were conceiving you.\nChuck Norris always maintains eye contact with you while he's plowing your girlfriend or mother.\nChuck Norris can ram a VHS tape into a DVD player and the motherfucker will play.\nMother Teresa said Chuck Norris was the only man she ever wanted to marry.\nChuck Norris was born before his mother got pregnant.\nThe reason why Chuck Norris is such a badass is he thought all the yo momma jokes were written about his mother.\nThe only time Chuck Norris was ever beaten was in a fictional movie, Way Of The Dragon, by Bruce Lee. Both Lee and his son Brandon would later die in mysterious curcumstances. This is not a motherfucking coincidence.\nOld Mother Hubbard Went to the cupboard, To give the poor doggy a bone: But when she bent over, Chuck Norris took over, 'cause Chuck had a bone of his own.\nLarry the Cable Guy was a nuclear science physics professor at MIT for only 3 seconds more after he called Chuck Norris' mother a \"slutty beatch of a crack whore\".\nFun Fact: The moment Chuck Norris was pulled from his mother's womb all the doctors and nurses in the hospital began to sing \"O' Fortuna\" in its entirety. There is still no scientific explanation as to how this happened.\nChuck Norris never fails to get a card from his dear mother on Mother's Day.\nOld Mother Hubbard went to the cupboard, To fetch her poor doggie a bone. But when she bent over, Chuck Norris took over. Because Chuck had a bone of his own.\nMichele Bachmann's face needed pastic surgery again after she called Chuck Norris' mother a social succubus for recieving social security payments that her husband & she paid into for 50 years.\nDid you know that Mother Nature had a one-night-stand with Father Time? The result was Chuck Norris.\nChuck Norris, motherfucker. Chuck fucking Norris.\nWhen Chuck Norris watches Bubble Guppies, he gets pissed off and jumps into the TV and roundhouse kicks the motherf$&!ing sh*t out of them.\nFor Bruce Willis' birthday, he received a DVD of Chuck Norris banging Demi Moore while repeatedly yelling 'Yippee Ki Yay, Motherfucker'. Norris then felt a rare twinge of guilt, so he then sent Willis a DVD of him pummeling Ashton Kutcher with Charlie Sheen.\nChuck Norris can smother a Velociraptor by clamping his anal sphincter around the raptor's nose.\nChuck Norris's mother left before he was born",
    "timestamp": "2024-07-15T12:41:23.567Z"
  }
]